app/controllers/customers_controller.rb

SELECT * FROM `customers`
---
  def index
    @customers = Customer.all

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO `customers` (`name`, `created_at`, `updated_at`) VALUES('Venkataramana', '2011-07-18 12:48:54', '2011-07-18 12:48:54')
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT * FROM `customers` WHERE (`customers`.`name` IS NULL) LIMIT 1
---
        def auto_complete_for_customer_name
                name = params[:customer][:name]
                @customers = Customer.find(:all,:conditions => ['name LIKE ?', "#{name}%"])

SELECT * FROM `customers` WHERE (`customers`.`id` = 7)
DELETE FROM `customers` WHERE `id` = 7
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy